#include "service.h"

void service::button_close()
{
	// нажмите кнопку, чтобы закрыть дверь
	// прин€ть кнопку
}

bool service::check_weight_max()
{
	// do
	//			запросить вес, сказать, что это примерно (вес/80) человек
	// пока (вес не меньше максимального)
	// дождатьс€ кнопки
	return true;
}

void service::in_floor()
{
	// открыть двери
	// if (check_weight_max()); // если так можно вообще ))0)
	// закрыть двери
	// call();
	// открыть двери
	// дождатьс€ кнопки
	// закрыть двери
}
